In [1]:
import pandas as pd
import numpy as np

In [2]:
data= {'kor':[10,30,50,70],
       'eng':[20,40,60,80],
       'math':[33,44,55,66]}
df = pd.DataFrame(data, index=['a','b','c','d'])
df

   kor  eng  math
a   10   20    33
b   30   40    44
c   50   60    55
d   70   80    66

In [8]:
# df['a']
# df['kor']
# df['eng']['a']
df['eng']

a    20
b    40
c    60
d    80
Name: eng, dtype: int64

In [9]:
df.kor # df['kor']

a    10
b    30
c    50
d    70
Name: kor, dtype: int64

In [10]:
df[ ['kor','math'] ]

   kor  math
a   10    33
b   30    44
c   50    55
d   70    66

In [12]:
# df[0:3]
df['a':'c']

   kor  eng  math
a   10   20    33
b   30   40    44
c   50   60    55

In [14]:
df

   kor  eng  math
a   10   20    33
b   30   40    44
c   50   60    55
d   70   80    66

In [15]:
# df.loc['a']
df.iloc[0]

kor     10
eng     20
math    33
Name: a, dtype: int64

In [16]:
df.loc['a':'c'] #df['a':'c']

   kor  eng  math
a   10   20    33
b   30   40    44
c   50   60    55

In [17]:
df.loc['a':'c', 'kor' ]

a    10
b    30
c    50
Name: kor, dtype: int64

In [19]:
df.loc['a':'c', 'eng':'math' ]

   eng  math
a   20    33
b   40    44
c   60    55

In [21]:
df.loc[ ['a','c','d'], ['kor','math'] ]

   kor  math
a   10    33
c   50    55
d   70    66

In [24]:
df.iloc[ 0:3 ]

   kor  eng  math
a   10   20    33
b   30   40    44
c   50   60    55

In [25]:
df.iloc[ 0:3, 1 ]

a    20
b    40
c    60
Name: eng, dtype: int64

In [26]:
df.iloc[ 0:3, 1: ]

   eng  math
a   20    33
b   40    44
c   60    55

In [27]:
df.iloc[ 0:3, [0,2] ]

   kor  math
a   10    33
b   30    44
c   50    55

In [28]:
df.iloc[ [0,1,3], [0,2] ]

   kor  math
a   10    33
b   30    44
d   70    66